---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Snappable
enum: Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage
source: html/e1c38aeb-52d1-69cc-8601-3f9c2637b4da.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Snappable

Can be snapped to as well as selected.